app/controllers/fbcontroller_controller.rb

  def signup
  	puts("********************************")
  #	byebug

  	Fbuser.create(
  		firstname: params["firstname"] ,
  		lastname: params["lastname"] ,
  		email: params["email"] ,
  		password: params["password"] ,
  		gender: params["gender"]
  		)
---
INSERT INTO "fbusers" ("firstname", "lastname", "email", "password", "gender", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def signin


  	@temp=Fbuser.find_by(email: params["emailfirst"])
---
SELECT  "fbusers".* FROM "fbusers" WHERE "fbusers"."email" = ? LIMIT 1  [["email", "123"]]

  def showallusers
  	@all=Fbuser.all
---
SELECT "fbusers".* FROM "fbusers"

  def delete

  	@p=Fbuser.find(params[:id].to_i)
  	@p.destroy
---
SELECT  "fbusers".* FROM "fbusers" WHERE "fbusers"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "fbusers" WHERE "fbusers"."id" = ?  [["id", 1]]