app/controllers/posts_controller.rb

SELECT "postsdbs".* FROM "postsdbs"
---
  def index
  	@posts = Postsdb.all

INSERT INTO "postsdbs" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ghsavmd"], ["content", "dshafb,"], ["created_at", "2017-09-03 13:48:41.517864"], ["updated_at", "2017-09-03 13:48:41.517864"]]
---
  def create
  	Postsdb.create(
  		title: params[:postsdb][:title] ,
  		content: params[:postsdb][:content]
  		)

SELECT  "postsdbs".* FROM "postsdbs" WHERE "postsdbs"."id" = ? LIMIT 1  [["id", 4]]
---
  def update

  	@p=Postsdb.find(params[:id].to_i)

SELECT  "postsdbs".* FROM "postsdbs" WHERE "postsdbs"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "postsdbs" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "postsdbs"."id" = ?  [["title", "POST3UPDATED"], ["content", "You have Notifications 3This is changed via DB Browser"], ["updated_at", "2017-09-03 14:49:35.949458"], ["id", 3]]
---
  def edit
  		@p=Postsdb.find(params[:id].to_i)

  		@p.update(title: params[:postsdb][:title] ,
  		content: params[:postsdb][:content])

SELECT  "postsdbs".* FROM "postsdbs" WHERE "postsdbs"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "postsdbs" WHERE "postsdbs"."id" = ?  [["id", 6]]
---
  def delete
  	@p=Postsdb.find(params[:id].to_i)
  	@p.destroy