app/controllers/userc_controller.rb

  def index
  	#self.name="Alchemy"

  	@users = Userdb.all

     if(!cookies[:user_id].blank?)
       @user_signed_in=Userdb.find(cookies[:user_id].to_i)
---
SELECT  "userdbs".* FROM "userdbs"  ORDER BY "userdbs"."id" ASC LIMIT 1
SELECT  "userdbs".* FROM "userdbs" WHERE "userdbs"."id" = ? LIMIT 1  [["id", 7]]

  def create

  #	byebug

  	puts('**********************')
	puts(params)

	Userdb.create(name:params["name"] , age:params["age"] , email:params["email"])
---
INSERT INTO "userdbs" ("name", "age", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sagarpreet Chadha"], ["age", 20], ["email", "chadha.sagarpreet97@gmail.com"], ["created_at", "2017-09-03 07:03:47.536868"], ["updated_at", "2017-09-03 07:03:47.536868"]]

  def create_session
    user = Userdb.find_by(email: params[:email])
---
SELECT  "userdbs".* FROM "userdbs" WHERE "userdbs"."email" = ? LIMIT 1  [["email", "name1@gmail.com"]]